#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-eWA4MPHtvBERzE3s

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_object.resume_bucket_contents["assets/img/favicon.ico"] will be created
  + resource "aws_s3_object" "resume_bucket_contents" {
      + acl                    = "private"
      + bucket                 = "resume.philward.io"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "556f31acd686989b1afcf382c05846aa"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/img/favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "resume/assets/img/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.resume_bucket_contents["assets/img/favicon.png"] will be created
  + resource "aws_s3_object" "resume_bucket_contents" {
      + acl                    = "private"
      + bucket                 = "resume.philward.io"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "4ae4619a21103deb3eb01332602e6738"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/img/favicon.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "resume/assets/img/favicon.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.resume_bucket_contents["assets/img/profile.png"] will be created
  + resource "aws_s3_object" "resume_bucket_contents" {
      + acl                    = "private"
      + bucket                 = "resume.philward.io"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "d1ba96a8dea86b873240d6896ba89a78"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/img/profile.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "resume/assets/img/profile.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.resume_bucket_contents["css/styles.css"] will be created
  + resource "aws_s3_object" "resume_bucket_contents" {
      + acl                    = "private"
      + bucket                 = "resume.philward.io"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "54e9eacc2e0b15451518184bfcf35258"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "css/styles.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "resume/css/styles.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.resume_bucket_contents["js/scripts.js"] will be created
  + resource "aws_s3_object" "resume_bucket_contents" {
      + acl                    = "private"
      + bucket                 = "resume.philward.io"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "d0f2fd5c0a7f17da7629f3aae5bfbd44"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/scripts.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "resume/js/scripts.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*